# FamilySymbolicRep Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilySymbolicRep Property
ParameterTypeId Class See Also
---
"Symbolic Representation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilySymbolicRep { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilySymbolicRep As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilySymbolicRep {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace